import React from 'react'
import style from './Information.module.scss'
import Header from '../Header/Header'

const InformationOfDepartment = (props) => {
    return (
        <div className={style['info1']}>
            <p>При кафедре созданы лаборатория компьютерной безопасности и лаборатория сетевых технологий, которые позволяют в полном объеме заниматься изучением вопросов информационной безопасности распределенных компьютерных систем, безопасностью сетей, безопасностью серверов и баз данных, а также техническими средствами защиты информации.</p><br />
            <p>Кафедра осуществляет подготовку по специальностям:</p><br />
            <p>&bull;<b>10.05.01.</b>  Компьютерная безопасность. Специализация «Безопасность распределенных компьютерных систем». Программа обучения (5,5 лет) направлена на подготовку специалистов, обладающих глубокими теоретическими знаниями в области информационных технологий (криптографическая защита информации, разработка программного обеспечения, администрирование сетей и серверов, разработка и администрирование информационных систем) и организационно-правовых основ, методик и технологий защиты конфиденциальной информации. Учебная программа по этой специальности помимо курсов по IT предполагает углубленную подготовку по математике и защите информации криптографическими методами</p><br />
            <p>&bull;<b>10.05.03.</b>  Информационная безопасность автоматизированных систем. Специализация «Обеспечение безопасности распределенных информационных систем» Программа обучения (5 лет) направлена на подготовку специалистов, обладающих глубокими теоретическими знаниями и практическими навыками в таких областях как техническая защита информации, разработка программного обеспечения, администрирование и защита сетей и серверов, разработка администрирование и защита информационных систем. Учебная программа по этой специальности помимо курсов по IT предполагает углубленную подготовку по организационно-правовым основам, методикам и техническим методам защиты информации (защита от сетевых атак, видеонаблюдение, обнаружение и установка закладок и т.п.)</p><br />
            <p>&bull;<b>10.03.01.</b> Информационная безопасность. Специализация ««Безопасность компьютерных систем». Учебная программа (4 года) ориентирована на подготовку высококвалифицированных IT сотрудников способных помимо разработки программного обеспечения, выполнять работы, связанные с аудитом информационных систем и обеспечением комплексной защиты информации, эффективным использованием средств автоматического контроля, обнаружения каналов утечки сведений, представляющих государственную, служебную и коммерческую тайну. В программу обучения входит изучение технологий разработки программного обеспечения, организационно-правовых основ, инженерно-технических, программно-аппаратных и криптографических средств защиты информации, что позволяет выпускникам успешно реализовывать себя как в сфере разработки, создания и эксплуатации комплексных систем защиты информации компьютерных систем.</p><br />
            <p>Кафедра также обеспечивает преподавание дисциплин, связанных с сетевыми технологиями и информационной безопасностью, для всех специальностей Института математики и компьютерных наук.</p><br />
            <p>К преподаванию привлекаются специалисты, имеющие большой опыт практической работы в области защиты информации, создания программного обеспечения компьютерных систем и вычислительных сетей. Налажены контакты с ведущими университетами России –, Новосибирским, Уральским, и Сибирским федеральными университетами, национальным исследовательским Южно-Уральским госуниверситетом, Челябинским государственным университетом, Уральский государственный университетом путей сообщения, ведущими подготовку специалистов по защите информации, что позволяет студентам пользоваться электронными ресурсами соответствующих кафедр. Кроме того, в рамках сотрудничества с компанией Cisco, сертификационные курсы которой входят в образовательные программы и академической программы компании Microsoft через локальную сеть и Интернет студенты имеют бесплатный доступ к современным электронных учебным ресурсам.</p><br />
            <p>Отзывы рынка труда свидетельствуют о соответствии уровня подготовки выпускников требованиям как образовательных, так и профессиональных стандартов Ассоциации предприятий компьютерных и информационных технологий (АП КИТ) России. Большинство работ (от 70 до 90 % в различные годы) выполнены по заказам предприятий и их результаты внедрены в соответствующей сфере деятельности.  Тематика работ выпускников - проектирование и разработка ПО для администрирования и мониторинга работы компьютерных сетей, информационная безопасность систем с беспроводным доступом, решение задач криптографической и стенографической защиты информации, информационная безопасность телекоммуникационных систем, математические вопросы защиты информации. Выпускниками широко использовались методы математического и программного моделирования, современные технологии программирования: Web-программирование, XML-технологии и др.</p><br />
            <p>Трудоустройство большинства выпускников происходит уже на 3 – 4 курсах, когда студенты проходят учебную и производственную практики. Студенты старших курсов проходили практику в таких организациях как Главное управление МЧС России по Тюменской области, подразделения ГУ Банка России по Тюменской области, Департамент земельных ресурсов администрации города Тюмени, подразделения ИФНС по Тюменской области, подразделения УВД по Тюменской области, Тюменская лаборатория судебной экспертизы Министерства юстиции РФ, Тюменский филиал ЗАО «Рустел», ООО «ЛУКОЙЛ-ИНФОРМ», ЗАО «ЛУКОЙЛ-АИК», «ООО»Виндекс», ОАО «Гипротюменнефтегаз», ООО «ЮТэйр-Инжиниринг», ООО «ЮТэйр-Техник», ООО «Сибнефтебанк», ТРИЦ, ООО ТННЦ Роснефть, Газпром и др.</p>
        </div>
    )
}

const StructureOfDepartment = (props) => {
    return (
        <div className={style['info2']}>
            <div><h1>Оленников Евгений Александрович</h1>&#8722;<span>Заведующий кафедрой, к.т.н.</span></div>
            <div><h1>Захаров Александр Анатольевич</h1>&#8722;<span>Профессор, д.т.н.</span></div>
            <div><h1>Бабич Андрей Владимирович</h1>&#8722;<span>Доцент, к.т.н.</span></div>
            <div><h1>Дубов Владимир Петрович</h1>&#8722;<span>Доцент, к.т.н.</span></div>
            <div><h1>Зулькарнеев Искандер Рашитович</h1>&#8722;<span>Доцент, к.т.н.</span></div>
            <div><h1>Желудкова Ольга Витальевна</h1>&#8722;<span>Доцент, к.т.н.</span></div>
            <div><h1>Нестерова Ольга Андреевна</h1>&#8722;<span>Доцент, к.т.н.</span></div>
            <div><h1>Ниссенбаум Ольга Владимировна</h1>&#8722;<span>Доцент, к.ф-м.н.</span></div>
            <div><h1>Оленников Алексей Александрович</h1>&#8722;<span>Доцент, к.т.н.</span></div>
            <div><h1>Широких Андрей Валерьевич</h1>&#8722;<span>Доцент, к.т.н.</span></div>
            <div><h1>Акимова Марина Михайловна</h1>&#8722;<span>Старший преподаватель</span></div>
            <div><h1>Воробьев Артем Максимович</h1>&#8722;<span>Старший преподаватель</span></div>
            <div><h1>Гасеев Руслан Валерьевич</h1>&#8722;<span>Старший преподаватель</span></div>
            <div><h1>Паюсова Татьяна Игоревна</h1>&#8722;<span>Старший преподаватель</span></div>
            <div><h1>Воробьев Артем Максимович</h1>&#8722;<span>Старший преподаватель</span></div>
            <div><h1>Петров Иван Петрович</h1>&#8722;<span>Старший преподаватель</span></div>
            <div><h1>Мухаметов Рузил Абильевич</h1>&#8722;<span>Ассистент</span></div>
            <div><h1>Новопашин Василий Михайлович</h1>&#8722;<span>Ассистент</span></div>
            <div><h1>Панфиленко Дмитрий Витальевич</h1>&#8722;<span>Ассистент</span></div>
            <div><h1>Пелевин Игорь Андреевич</h1>&#8722;<span>Ассистент</span></div>
            <div><h1>Пуртов Владимир Георгиевич</h1>&#8722;<span>Ассистент</span></div>
            <div><h1>Сироткин Алексей Михайлович</h1>&#8722;<span>Ассистент</span></div>
        </div>
    )
}

class Information extends React.Component {
    constructor(props) {
        super(props);
        this.state = {
            isShowInfo: true,
            isActiveShowInfo: true,
            isActiveShowStructure: false,
        };
    }
    showInfo = (e) => {
        e.preventDefault();
        this.setState({
            isShowInfo: !this.state.isShowInfo,
            isActiveShowInfo: !this.state.isActiveShowInfo,
            isActiveShowStructure: !this.state.isActiveShowStructure
        });
    }
    render() {
        return (
            <>
                <Header />
                <div className={style['container']}>
                    <div className={style['information']}>
                        <div className={style['menu']}>
                            <a href='#s' className={this.state.isActiveShowInfo ? style['active-btn'] : null} onClick={this.showInfo}>Информация о работе кафедры</a>
                            <a href='#s' className={this.state.isActiveShowStructure ? style['active-btn'] : null} onClick={this.showInfo}>Состав кафедры</a>
                            {/* <a href='#s' onClick={this.showInfo}>Контакты</a> */}
                        </div>
                        <div className={style['content']}>
                            {this.state.isShowInfo ? <InformationOfDepartment /> : <StructureOfDepartment />}
                            {/* {this.state.isShowStructure ?  : null} */}
                        </div>
                    </div>
                </div>

            </>
        )
    }

};

export default Information;